data = """410000000,1,รายรับที่รับรู้เป็นรายได้
410100000,2,รายได้จากการจัดการศึกษา
410102000,3,ค่าธรรมเนียมการศึกษาระดับปริญญาตรี
410102001,4,ค่าหน่วยกิต ภาคบรรยาย
410102002,4,ค่าหน่วยกิต ภาคปฏิบัติการ
410102003,4,ค่าหน่วยกิต ภาคบรรยายและภาคปฏิบัติการ
410102004,4,ค่าธรรมเนียมพิเศษ
410102005,4,ค่าธรรมเนียมโครงการพิเศษ
410102006,4,ค่าธรรมเนียมการศึกษาพิเศษ
410102007,4,ค่าธรรมเนียมการสมัคร
410102999,4,ค่าธรรมเนียมอื่น ๆ 
410103000,3,ค่าธรรมเนียมการศึกษาระดับบัณฑิตศึกษา
410103001,4,ค่าธรรมเนียมการศึกษาภาคปกติ ป.โท
410103002,4,ค่าธรรมเนียมการศึกษาภาคปกติ ป. เอก
410103003,4,ค่าธรรมเนียมการศึกษาภาคพิเศษ ป.โท
410103004,4,ค่าธรรมเนียมการศึกษาภาคพิเศษ ป.เอก
410103006,4,ค่าธรรมเนียมการสอบการศึกษาอิสระ
410103007,4,ค่าธรรมเนียมการสอบวิทยานิพนธ์
410103008,4,ค่าธรรมเนียมการสอบวัดคุณสมบัติ
410103009,4,ค่าธรรมเนียมการสอบประมวลความรู้
410103010,4,ค่าใบสมัครและระเบียบการสอบคัดเลือก
410103011,4,ค่าสมัครสอบคัดเลือก
410103013-1,4,ค่าธรรมเนียมการวิจัยหลักสูตร ป.เอก
410103013-2,4,ค่าธรรมเนียมการวิจัยหลักสูตร ป.โท
410103999,4,ค่าธรรมเนียมอื่นๆ
410104000,3,ค่าธรรมเนียมการศึกษานักศึกษาต่างชาติ
410104001,4,ค่าธรรมเนียมการศึกษาต่างชาติ ป. ตรี
410104002,4,ค่าธรรมเนียมการศึกษาต่างชาติ สูงกว่า ป.ตรี
410105000,3,ค่าธรรมเนียมอื่นที่เรียกเก็บจากบุคคลภายนอก
410105001,4,ค่าสมัครและสอบคัดเลือก
410105002,4,ค่าบำรุงการศึกษา
410105003,4,ค่าธรรมเนียมการศึกษา
410106000,3,ค่าธรรมเนียมอื่น ๆ
410106002,4,ค่าธรรมเนียมหนังสือรับรอง
410106004,4,ค่าธรรมเนียมรับสมัครรับตรง
410106999,4,ค่าธรรมเนียมอื่น ๆ 
410300000,2,รายได้จากการให้บริการทางวิชาการ
410301000,3,ค่าบริการวิชาการ
410301001,4,ค่าวิเคราะห์ตัวอย่าง (พืช,สัตว์,ดิน,โรคพืช)
410301002,4,ค่าทดสอบวัสดุ
410301003,4,ค่าตรวจทางห้องปฏิบัติการ
410301014,4,ค่าบริการพิมพ์ผลด้วยเครื่องพล็อตเตอร์ (Plotter Inkget)
410301015,4,ค่าบริการพิมพ์ผลด้วยเครื่องพิมพ์เลเซอร์
410301017,4,ค่าธรรมเนียมการให้บริการ
410302000,3,ค่าบริการฝึกอบรม
410302001,4,ค่าบริการฝึกอบรม
410302002,4,ค่าลงทะเบียนฝึกอบรม/สัมมนา
410303000,3,ค่าบริการวิชาการที่ปรึกษา/วิจัย
410303001,4,ค่าบริการวิชาการที่ปรึกษา/วิจัย
410304000,3,ค่าบริการจัดประชุมวิชาการ (Conference)
410304001,4,ค่าลงทะเบียนประชุมวิชาการ (Conference)
410304002,4,เงินสนับสนุนประชุมวิชาการ
410400000,2,รายได้จากการบริหารสินทรัพย์
410401000,3,ค่าเช่าอาคาร
410401003,4,ค่าเช่าอาคารทั่วไป
410402000,3,ค่าเช่าร้านค้า
410402001,4,ค่าเช่าร้านค้า
410403000,3,ค่าบำรุงการใช้อาคารและสถานที่
410403001,4,ค่าบำรุงการใช้อาคารและสถานที่
410404000,3,ค่าบำรุงการใช้ทรัพย์สิน
410404001,4,ค่าบำรุงการใช้เครื่องคอมพิวเตอร์
410404002,4,ค่าบำรุงการใช้ล็อคเกอร์
410404003,4,ค่าบำรุงการใช้รถยนต์
410404007,4,ค่าบริการใช้ห้องฝึกอบรม
410404008,4,ค่าบริการใช้ห้อง Video Conference พร้อมอุปกรณ์ (ไม่รวมค่าเช่าสัญญาณการสื่อสาร)
410404011,4,ค่าบำรุงการใช้อุปกรณ์ห้องปฎิบัติการ
410404013,4,ค่าบำรุงการใช้ระบบปฎิบัติการ
410500000,2,รายได้ดอกเบี้ยรับและรายได้จากการลงทุน
410501000,4,ดอกเบี้ยรับ
410502000,4,ดอกเบี้ยที่ได้รับจัดสรร
410503000,4,เงินตอบแทนหรือเงินปันผล
410505000,4,ดอกเบี้ยรับจากกองทุน
410600000,2,รายได้จากการรับบริจาค
410601000,4,เงินบริจาคเพื่อเป็นทุนการศึกษา
410602000,4,เงินบริจาคทั่วไป
410603000,4,เงินช่วยเหลือ/เงินสนับสนุน
410604000,4,เงินสนับสนุนให้นักศึกษาจากหน่วยงานอื่น
410605000,4,เงินสนับสนุนในการจัดกิจกรรม
410800000,2,รายได้จากการจำหน่ายผลิตผลจากการเรียนการสอน
410803000,4,ค่าขายผลผลิตจากห้องปฏิบัติการ
410804000,4,ค่าขายหนังสือระเบียบการ
410805000,4,ค่าขายวารสารทางวิชาการ
410806000,4,ค่าขายตำราการเรียนการสอน
410807000,4,ค่าขายหนังสืออื่น ๆ
410808000,4,ค่าขายสิ่งของอื่น ๆ
410900000,2,รายได้ค่าปรับและเงินชดใช้ค่าเสียหาย
410901000,3,ค่าปรับผิดสัญญาหรือข้อตกลงซื้อขาย
410901001,4,ค่าปรับผิดสัญญาหรือข้อตกลงซื้อขาย
410902000,3,ค่าปรับผิดสัญญาหรือข้อตกลงจ้าง
410902001,4,ค่าปรับผิดสัญญาหรือข้อตกลงจ้าง
410903000,3,ค่าปรับผิดสัญญาลาศึกษาต่อ
410903001,4,ค่าปรับผิดสัญญาลาศึกษาต่อ
410903002,4,ค่าปรับผิดสัญญาชดใช้ทุน
410904000,3,ค่าปรับผิดสัญญาอื่น ๆ 
410904001,4,ค่าปรับผิดสัญญาอื่น ๆ 
410904002,4,ค่าปรับผิดสัญญาเงินยืม
410905000,3,ค่าปรับอื่น
410905001,4,ค่าปรับผิดระเบียบ
410907000,3,เงินชดใช้เสียหาย (อาคารและสถานที่)
410907001,4,เงินชดใช้เสียหาย (อาคารและสถานที่)
410908000,3,ค่าปรับและเงินชดใช้ค่าเสียหายที่เก็บจากนักศึกษา
410908003,4,เงินชดใช้ค่าเสียหายห้องปฎิบัติการ
410908004,4,เงินชดใช้ค่าเสียหายตู้ล็อคเกอร์
410908009,4,เงินชดใช้ค่าเสียหายกุญแจโต๊ะห้องปฏิบัติการ
410908010,4,เงินชดใช้ค่าเสียหายหนังสือ
410908013,4,ค่าปรับห้องสมุด
410908999,4,ค่าปรับอื่น ๆ
411000000,2,รายได้ค่าธรรมเนียมสาธารณูปโภค
411001000,4,รายได้ค่าน้ำประปา
411002000,4,รายได้ค่าไฟฟ้า
411100000,2,รายได้จากเงินเหลือจ่าย
411101000,4,เงินเหลือจ่ายปีเก่า
411200000,2,รายได้อื่น ๆ 
411203000,4,ค่าขายแบบก่อสร้าง
411204000,4,ค่าขายแบบครุภัณฑ์
411205000,4,ค่าออกหนังสือรับรอง
411206000,4,ค่าขายระเบียบการ
411207000,4,ค่าขายใบสมัคร
411208000,4,ค่าขายของเบ็ดเตล็ด
411209000,4,ค่าขายเอกสารประกวดราคา
411210000,4,ค่าขายพัสดุชำรุด
411211000,4,ค่าขายแบบจ้างเหมาสอบราคา
411299000,4,อื่น ๆ
411300000,2,รายได้จากการวิจัย 
411301000,4,เงินอุดหนุนเพื่อการวิจัย
411302000,4,รายได้ให้เช่าอุปกรณ์เพื่อการวิจัย
411303000,4,รายได้จากผลงานวิจัย
411304000,4,รายได้อื่นจากการวิจัย
411500000,2,รายได้เงินสนับสนุนเพื่อการเรียนการสอน 
411501000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จาก สกอ.
411502000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากแหล่งทุนในประเทศ
411503000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากแหล่งทุนต่างประเทศ
411504000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานภาคอุตสาหกรรม
411505000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานระดับกระทรวง
411506000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานระดับจังหวัด
411507000,4,เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานภาคเอกชน
411508000,4,เงินสนับสนุนเพื่อการเรียนการสอน-เงินสนับสนุนจากแหล่งอื่น
411600000,2,รายได้เงินสนับสนุนเพื่อกิจกรรมนักศึกษา
411601000,4,เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากหน่วยงานภาครัฐ
411602000,4,เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากหน่วยงานภาคเอกชน
411603000,4,เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากแหล่งอื่น
411700000,2,รายได้เงินสนับสนุนเพื่อการวิจัย
411701000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จาก สวทช.
411702000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จาก สกอ.
411703000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จาก วช.
411704000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากแหล่งทุนในประเทศ
411705000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากแหล่งทุนต่างประเทศ
411706000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานภาคอุตสาหกรรม
411707000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานระดับกระทรวง
411708000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานระดับจังหวัด
411709000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานภาคเอกชน
411710000,4,เงินสนับสนุนเพื่อการวิจัยจาก-จากเงินสนับสนุนจากแหล่งอื่น
411800000,2,รายได้เงินสนับสนุนเพื่อบริการวิชาการ
411801000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากสกอ.
411802000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากแหล่งทุนในประเทศ
411803000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากแหล่งทุนต่างประเทศ
411804000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานภาคอุตสาหกรรม
411805000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานระดับกระทรวง
411806000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานระดับจังหวัด
411807000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานภาคเอกชน
411808000,4,เงินสนับสนุนเพื่อบริการวิชาการ-จากเงินสนับสนุนจากแหล่งอื่น
412101000,2,รายได้ให้บริการอื่น
412101001,4,รายได้การจัดสอบ O-NET
412101002,4,รายได้การจัดสอบคัดเลือกบุคคลเข้าศึกษา
412101003,4,รายได้การจัดสอบคัดเลือกบุคคลเพื่อปฏิบัติงาน
412000000,2,รายได้เงินสนับสนุนอื่น
412200000,4,รายได้เงินสนับสนุนอื่น
420000000,1,รายรับที่ต้องจ่ายคืน (รับเพื่อตั้งหนี้)
420100000,2,เงินรับฝากที่ต้องจ่ายคืน
420101000,4,เงินรับที่หักเกินสัญญาเงินยืม
420103000,4,ค่าควบคุมงานก่อสร้าง
420199000,4,อื่น ๆ
420200000,2,เงินรับแทนหน่วยงานอื่น
420201000,4,ภาษีหัก ณ ที่จ่าย-ภาษีเงินได้บุคคลธรรมดา
420202000,4,ภาษีหัก ณ ที่จ่าย-ภาษีเงินได้บุคคลธรรมดา ภงด.1
420205000,4,ค่าปรับรอนำส่ง กระทรวงการคลัง
420207000,4,ค่ากระแสไฟฟ้า
420209000,4,เงินประกันสังคม
420212000,4,ค่าโทรศัพท์/โทรสาร
420213000,4,เบิกเกินส่งคืน(เงินเดือน,ค่าจ้าง)
420300000,2,เงินประกันที่ต้องจ่ายคืน
420301000,3,เงินประกันที่เก็บจากบุคคลภายนอก
420301001,4,เงินประกันซองเสนอราคา
420301002,4,เงินประกันสัญญาซื้อขาย/สัญญาจ้าง
420301003,4,เงินประกันสัญญาการเช่าร้านค้า
420301004,4,เงินประกันผลงาน
420301007,4,เงินประกันร้านอาหาร
420301999,4,อื่น ๆ
420302000,3,เงินประกันที่เก็บจากนักศึกษา
420302003,4,เงินประกันค่าเสียหายห้องปฏิบัติการ
420302004,4,เงินประกันตู้ล็อคเกอร์
420302012,4,เงินประกันของเสียหายทั่วไป
420302999,4,อื่น ๆ
430000000,1,รายรับที่เข้าเป็นทุนหมุนเวียน
430100000,2,เงินรับ-จ่าย ประเภทกองทุน
430101000,3,เงินรับ-จ่าย ประเภทกองทุน
430101024,4,กองทุนพัฒนาและส่งเสริมวิชาการ - คณะวิทย์
430101025,4,กองทุนสัปดาห์วิทย์ฯ - คณะวิทย์
430101026,4,กองทุนพัฒนาบุคลากรฯ-คณะวิทย์
430101086,4,กองทุนส่งเสริมและพัฒนาการผลิตบัณฑิต-คณะวิทย์
430101099,4,กองทุนสนับสนุนการวิจัยฯ-คณะวิทย์
430101122,4,กองทุน 50 ปี คณะวิทย์
430200000,2,เงินบริจากเพื่อทุนการศึกษา (คงยอดเงินต้น)
430201000,3,เงินทุนการศึกษา
430201999,4,ทุนอื่น ๆ
430202000,2,เงินบริจาคเพื่อสนับสนุนสถานศึกษา
430202001,4,เงินบริจาคเพื่อสนับสนุนสถานศึกษา (เงินที่รับบริจาคจากบุคลอื่นเพื่อใช้ซื้อวัสดุ ครุภัณฑ์)
440000000,4,รายรับรอการรับรู้
440101000,2,รับจากนักศึกษา
440101001,4,เงินค่าลงทะเบียน
440101002,4,เงินค่าธรรมเนียม
440102000,2,รับจากบุคคลภายนอก
440102001,4,รับเงินช่วยเหลือ/เงินสนับสนุน
440102002,4,รับเงินทุนการศึกษา
440102003,4,รับเงินค่าปรับ
440102005,4,รับบริการวิชาการที่ปรึกษา/วิจัย
440102007,4,รับงินบริจาค
440102099,4,รับอื่น ๆ"""

lines = data.split('\n')

for i in lines:
    sec = i.split(',')
    print("'", sec[0], "': { depth: ", sec[1],", name: '", sec[2],"'},", sep='')