module.exports = {
  "410000000": { depth: 1, name: "รายรับที่รับรู้เป็นรายได้" },
  "410100000": { depth: 2, name: "รายได้จากการจัดการศึกษา" },
  "410102000": { depth: 3, name: "ค่าธรรมเนียมการศึกษาระดับปริญญาตรี" },
  "410102001": { depth: 4, name: "ค่าหน่วยกิต ภาคบรรยาย" },
  "410102002": { depth: 4, name: "ค่าหน่วยกิต ภาคปฏิบัติการ" },
  "410102003": { depth: 4, name: "ค่าหน่วยกิต ภาคบรรยายและภาคปฏิบัติการ" },
  "410102004": { depth: 4, name: "ค่าธรรมเนียมพิเศษ" },
  "410102005": { depth: 4, name: "ค่าธรรมเนียมโครงการพิเศษ" },
  "410102006": { depth: 4, name: "ค่าธรรมเนียมการศึกษาพิเศษ" },
  "410102007": { depth: 4, name: "ค่าธรรมเนียมการสมัคร" },
  "410102999": { depth: 4, name: "ค่าธรรมเนียมอื่น ๆ " },
  "410103000": { depth: 3, name: "ค่าธรรมเนียมการศึกษาระดับบัณฑิตศึกษา" },
  "410103001": { depth: 4, name: "ค่าธรรมเนียมการศึกษาภาคปกติ ป.โท" },
  "410103002": { depth: 4, name: "ค่าธรรมเนียมการศึกษาภาคปกติ ป. เอก" },
  "410103003": { depth: 4, name: "ค่าธรรมเนียมการศึกษาภาคพิเศษ ป.โท" },
  "410103004": { depth: 4, name: "ค่าธรรมเนียมการศึกษาภาคพิเศษ ป.เอก" },
  "410103006": { depth: 4, name: "ค่าธรรมเนียมการสอบการศึกษาอิสระ" },
  "410103007": { depth: 4, name: "ค่าธรรมเนียมการสอบวิทยานิพนธ์" },
  "410103008": { depth: 4, name: "ค่าธรรมเนียมการสอบวัดคุณสมบัติ" },
  "410103009": { depth: 4, name: "ค่าธรรมเนียมการสอบประมวลความรู้" },
  "410103010": { depth: 4, name: "ค่าใบสมัครและระเบียบการสอบคัดเลือก" },
  "410103011": { depth: 4, name: "ค่าสมัครสอบคัดเลือก" },
  "410103013-1": { depth: 4, name: "ค่าธรรมเนียมการวิจัยหลักสูตร ป.เอก" },
  "410103013-2": { depth: 4, name: "ค่าธรรมเนียมการวิจัยหลักสูตร ป.โท" },
  "410103999": { depth: 4, name: "ค่าธรรมเนียมอื่นๆ" },
  "410104000": { depth: 3, name: "ค่าธรรมเนียมการศึกษานักศึกษาต่างชาติ" },
  "410104001": { depth: 4, name: "ค่าธรรมเนียมการศึกษาต่างชาติ ป. ตรี" },
  "410104002": { depth: 4, name: "ค่าธรรมเนียมการศึกษาต่างชาติ สูงกว่า ป.ตรี" },
  "410105000": { depth: 3, name: "ค่าธรรมเนียมอื่นที่เรียกเก็บจากบุคคลภายนอก" },
  "410105001": { depth: 4, name: "ค่าสมัครและสอบคัดเลือก" },
  "410105002": { depth: 4, name: "ค่าบำรุงการศึกษา" },
  "410105003": { depth: 4, name: "ค่าธรรมเนียมการศึกษา" },
  "410106000": { depth: 3, name: "ค่าธรรมเนียมอื่น ๆ" },
  "410106002": { depth: 4, name: "ค่าธรรมเนียมหนังสือรับรอง" },
  "410106004": { depth: 4, name: "ค่าธรรมเนียมรับสมัครรับตรง" },
  "410106999": { depth: 4, name: "ค่าธรรมเนียมอื่น ๆ " },
  "410300000": { depth: 2, name: "รายได้จากการให้บริการทางวิชาการ" },
  "410301000": { depth: 3, name: "ค่าบริการวิชาการ" },
  "410301001": { depth: 4, name: "ค่าวิเคราะห์ตัวอย่าง (พืช" },
  "410301002": { depth: 4, name: "ค่าทดสอบวัสดุ" },
  "410301003": { depth: 4, name: "ค่าตรวจทางห้องปฏิบัติการ" },
  "410301014": {
    depth: 4,
    name: "ค่าบริการพิมพ์ผลด้วยเครื่องพล็อตเตอร์ (Plotter Inkget)"
  },
  "410301015": { depth: 4, name: "ค่าบริการพิมพ์ผลด้วยเครื่องพิมพ์เลเซอร์" },
  "410301017": { depth: 4, name: "ค่าธรรมเนียมการให้บริการ" },
  "410302000": { depth: 3, name: "ค่าบริการฝึกอบรม" },
  "410302001": { depth: 4, name: "ค่าบริการฝึกอบรม" },
  "410302002": { depth: 4, name: "ค่าลงทะเบียนฝึกอบรม/สัมมนา" },
  "410303000": { depth: 3, name: "ค่าบริการวิชาการที่ปรึกษา/วิจัย" },
  "410303001": { depth: 4, name: "ค่าบริการวิชาการที่ปรึกษา/วิจัย" },
  "410304000": { depth: 3, name: "ค่าบริการจัดประชุมวิชาการ (Conference)" },
  "410304001": { depth: 4, name: "ค่าลงทะเบียนประชุมวิชาการ (Conference)" },
  "410304002": { depth: 4, name: "เงินสนับสนุนประชุมวิชาการ" },
  "410400000": { depth: 2, name: "รายได้จากการบริหารสินทรัพย์" },
  "410401000": { depth: 3, name: "ค่าเช่าอาคาร" },
  "410401003": { depth: 4, name: "ค่าเช่าอาคารทั่วไป" },
  "410402000": { depth: 3, name: "ค่าเช่าร้านค้า" },
  "410402001": { depth: 4, name: "ค่าเช่าร้านค้า" },
  "410403000": { depth: 3, name: "ค่าบำรุงการใช้อาคารและสถานที่" },
  "410403001": { depth: 4, name: "ค่าบำรุงการใช้อาคารและสถานที่" },
  "410404000": { depth: 3, name: "ค่าบำรุงการใช้ทรัพย์สิน" },
  "410404001": { depth: 4, name: "ค่าบำรุงการใช้เครื่องคอมพิวเตอร์" },
  "410404002": { depth: 4, name: "ค่าบำรุงการใช้ล็อคเกอร์" },
  "410404003": { depth: 4, name: "ค่าบำรุงการใช้รถยนต์" },
  "410404007": { depth: 4, name: "ค่าบริการใช้ห้องฝึกอบรม" },
  "410404008": {
    depth: 4,
    name:
      "ค่าบริการใช้ห้อง Video Conference พร้อมอุปกรณ์ (ไม่รวมค่าเช่าสัญญาณการสื่อสาร)"
  },
  "410404011": { depth: 4, name: "ค่าบำรุงการใช้อุปกรณ์ห้องปฎิบัติการ" },
  "410404013": { depth: 4, name: "ค่าบำรุงการใช้ระบบปฎิบัติการ" },
  "410500000": { depth: 2, name: "รายได้ดอกเบี้ยรับและรายได้จากการลงทุน" },
  "410501000": { depth: 4, name: "ดอกเบี้ยรับ" },
  "410502000": { depth: 4, name: "ดอกเบี้ยที่ได้รับจัดสรร" },
  "410503000": { depth: 4, name: "เงินตอบแทนหรือเงินปันผล" },
  "410505000": { depth: 4, name: "ดอกเบี้ยรับจากกองทุน" },
  "410600000": { depth: 2, name: "รายได้จากการรับบริจาค" },
  "410601000": { depth: 4, name: "เงินบริจาคเพื่อเป็นทุนการศึกษา" },
  "410602000": { depth: 4, name: "เงินบริจาคทั่วไป" },
  "410603000": { depth: 4, name: "เงินช่วยเหลือ/เงินสนับสนุน" },
  "410604000": { depth: 4, name: "เงินสนับสนุนให้นักศึกษาจากหน่วยงานอื่น" },
  "410605000": { depth: 4, name: "เงินสนับสนุนในการจัดกิจกรรม" },
  "410800000": { depth: 2, name: "รายได้จากการจำหน่ายผลิตผลจากการเรียนการสอน" },
  "410803000": { depth: 4, name: "ค่าขายผลผลิตจากห้องปฏิบัติการ" },
  "410804000": { depth: 4, name: "ค่าขายหนังสือระเบียบการ" },
  "410805000": { depth: 4, name: "ค่าขายวารสารทางวิชาการ" },
  "410806000": { depth: 4, name: "ค่าขายตำราการเรียนการสอน" },
  "410807000": { depth: 4, name: "ค่าขายหนังสืออื่น ๆ" },
  "410808000": { depth: 4, name: "ค่าขายสิ่งของอื่น ๆ" },
  "410900000": { depth: 2, name: "รายได้ค่าปรับและเงินชดใช้ค่าเสียหาย" },
  "410901000": { depth: 3, name: "ค่าปรับผิดสัญญาหรือข้อตกลงซื้อขาย" },
  "410901001": { depth: 4, name: "ค่าปรับผิดสัญญาหรือข้อตกลงซื้อขาย" },
  "410902000": { depth: 3, name: "ค่าปรับผิดสัญญาหรือข้อตกลงจ้าง" },
  "410902001": { depth: 4, name: "ค่าปรับผิดสัญญาหรือข้อตกลงจ้าง" },
  "410903000": { depth: 3, name: "ค่าปรับผิดสัญญาลาศึกษาต่อ" },
  "410903001": { depth: 4, name: "ค่าปรับผิดสัญญาลาศึกษาต่อ" },
  "410903002": { depth: 4, name: "ค่าปรับผิดสัญญาชดใช้ทุน" },
  "410904000": { depth: 3, name: "ค่าปรับผิดสัญญาอื่น ๆ " },
  "410904001": { depth: 4, name: "ค่าปรับผิดสัญญาอื่น ๆ " },
  "410904002": { depth: 4, name: "ค่าปรับผิดสัญญาเงินยืม" },
  "410905000": { depth: 3, name: "ค่าปรับอื่น" },
  "410905001": { depth: 4, name: "ค่าปรับผิดระเบียบ" },
  "410907000": { depth: 3, name: "เงินชดใช้เสียหาย (อาคารและสถานที่)" },
  "410907001": { depth: 4, name: "เงินชดใช้เสียหาย (อาคารและสถานที่)" },
  "410908000": {
    depth: 3,
    name: "ค่าปรับและเงินชดใช้ค่าเสียหายที่เก็บจากนักศึกษา"
  },
  "410908003": { depth: 4, name: "เงินชดใช้ค่าเสียหายห้องปฎิบัติการ" },
  "410908004": { depth: 4, name: "เงินชดใช้ค่าเสียหายตู้ล็อคเกอร์" },
  "410908009": { depth: 4, name: "เงินชดใช้ค่าเสียหายกุญแจโต๊ะห้องปฏิบัติการ" },
  "410908010": { depth: 4, name: "เงินชดใช้ค่าเสียหายหนังสือ" },
  "410908013": { depth: 4, name: "ค่าปรับห้องสมุด" },
  "410908999": { depth: 4, name: "ค่าปรับอื่น ๆ" },
  "411000000": { depth: 2, name: "รายได้ค่าธรรมเนียมสาธารณูปโภค" },
  "411001000": { depth: 4, name: "รายได้ค่าน้ำประปา" },
  "411002000": { depth: 4, name: "รายได้ค่าไฟฟ้า" },
  "411100000": { depth: 2, name: "รายได้จากเงินเหลือจ่าย" },
  "411101000": { depth: 4, name: "เงินเหลือจ่ายปีเก่า" },
  "411200000": { depth: 2, name: "รายได้อื่น ๆ " },
  "411203000": { depth: 4, name: "ค่าขายแบบก่อสร้าง" },
  "411204000": { depth: 4, name: "ค่าขายแบบครุภัณฑ์" },
  "411205000": { depth: 4, name: "ค่าออกหนังสือรับรอง" },
  "411206000": { depth: 4, name: "ค่าขายระเบียบการ" },
  "411207000": { depth: 4, name: "ค่าขายใบสมัคร" },
  "411208000": { depth: 4, name: "ค่าขายของเบ็ดเตล็ด" },
  "411209000": { depth: 4, name: "ค่าขายเอกสารประกวดราคา" },
  "411210000": { depth: 4, name: "ค่าขายพัสดุชำรุด" },
  "411211000": { depth: 4, name: "ค่าขายแบบจ้างเหมาสอบราคา" },
  "411299000": { depth: 4, name: "อื่น ๆ" },
  "411300000": { depth: 2, name: "รายได้จากการวิจัย " },
  "411301000": { depth: 4, name: "เงินอุดหนุนเพื่อการวิจัย" },
  "411302000": { depth: 4, name: "รายได้ให้เช่าอุปกรณ์เพื่อการวิจัย" },
  "411303000": { depth: 4, name: "รายได้จากผลงานวิจัย" },
  "411304000": { depth: 4, name: "รายได้อื่นจากการวิจัย" },
  "411500000": { depth: 2, name: "รายได้เงินสนับสนุนเพื่อการเรียนการสอน " },
  "411501000": { depth: 4, name: "เงินสนับสนุนเพื่อการเรียนการสอน-จาก สกอ." },
  "411502000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากแหล่งทุนในประเทศ"
  },
  "411503000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากแหล่งทุนต่างประเทศ"
  },
  "411504000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานภาคอุตสาหกรรม"
  },
  "411505000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานระดับกระทรวง"
  },
  "411506000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานระดับจังหวัด"
  },
  "411507000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-จากหน่วยงานภาคเอกชน"
  },
  "411508000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการเรียนการสอน-เงินสนับสนุนจากแหล่งอื่น"
  },
  "411600000": { depth: 2, name: "รายได้เงินสนับสนุนเพื่อกิจกรรมนักศึกษา" },
  "411601000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากหน่วยงานภาครัฐ"
  },
  "411602000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากหน่วยงานภาคเอกชน"
  },
  "411603000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อกิจกรรมนักศึกษา-จากแหล่งอื่น"
  },
  "411700000": { depth: 2, name: "รายได้เงินสนับสนุนเพื่อการวิจัย" },
  "411701000": { depth: 4, name: "เงินสนับสนุนเพื่อการวิจัยจาก-จาก สวทช." },
  "411702000": { depth: 4, name: "เงินสนับสนุนเพื่อการวิจัยจาก-จาก สกอ." },
  "411703000": { depth: 4, name: "เงินสนับสนุนเพื่อการวิจัยจาก-จาก วช." },
  "411704000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากแหล่งทุนในประเทศ"
  },
  "411705000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากแหล่งทุนต่างประเทศ"
  },
  "411706000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานภาคอุตสาหกรรม"
  },
  "411707000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานระดับกระทรวง"
  },
  "411708000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานระดับจังหวัด"
  },
  "411709000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากหน่วยงานภาคเอกชน"
  },
  "411710000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อการวิจัยจาก-จากเงินสนับสนุนจากแหล่งอื่น"
  },
  "411800000": { depth: 2, name: "รายได้เงินสนับสนุนเพื่อบริการวิชาการ" },
  "411801000": { depth: 4, name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากสกอ." },
  "411802000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากแหล่งทุนในประเทศ"
  },
  "411803000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากแหล่งทุนต่างประเทศ"
  },
  "411804000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานภาคอุตสาหกรรม"
  },
  "411805000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานระดับกระทรวง"
  },
  "411806000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานระดับจังหวัด"
  },
  "411807000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากหน่วยงานภาคเอกชน"
  },
  "411808000": {
    depth: 4,
    name: "เงินสนับสนุนเพื่อบริการวิชาการ-จากเงินสนับสนุนจากแหล่งอื่น"
  },
  "412101000": { depth: 2, name: "รายได้ให้บริการอื่น" },
  "412101001": { depth: 4, name: "รายได้การจัดสอบ O-NET" },
  "412101002": { depth: 4, name: "รายได้การจัดสอบคัดเลือกบุคคลเข้าศึกษา" },
  "412101003": {
    depth: 4,
    name: "รายได้การจัดสอบคัดเลือกบุคคลเพื่อปฏิบัติงาน"
  },
  "412000000": { depth: 2, name: "รายได้เงินสนับสนุนอื่น" },
  "412200000": { depth: 4, name: "รายได้เงินสนับสนุนอื่น" },
  "420000000": { depth: 1, name: "รายรับที่ต้องจ่ายคืน (รับเพื่อตั้งหนี้)" },
  "420100000": { depth: 2, name: "เงินรับฝากที่ต้องจ่ายคืน" },
  "420101000": { depth: 4, name: "เงินรับที่หักเกินสัญญาเงินยืม" },
  "420103000": { depth: 4, name: "ค่าควบคุมงานก่อสร้าง" },
  "420199000": { depth: 4, name: "อื่น ๆ" },
  "420200000": { depth: 2, name: "เงินรับแทนหน่วยงานอื่น" },
  "420201000": { depth: 4, name: "ภาษีหัก ณ ที่จ่าย-ภาษีเงินได้บุคคลธรรมดา" },
  "420202000": {
    depth: 4,
    name: "ภาษีหัก ณ ที่จ่าย-ภาษีเงินได้บุคคลธรรมดา ภงด.1"
  },
  "420205000": { depth: 4, name: "ค่าปรับรอนำส่ง กระทรวงการคลัง" },
  "420207000": { depth: 4, name: "ค่ากระแสไฟฟ้า" },
  "420209000": { depth: 4, name: "เงินประกันสังคม" },
  "420212000": { depth: 4, name: "ค่าโทรศัพท์/โทรสาร" },
  "420213000": { depth: 4, name: "เบิกเกินส่งคืน(เงินเดือน" },
  "420300000": { depth: 2, name: "เงินประกันที่ต้องจ่ายคืน" },
  "420301000": { depth: 3, name: "เงินประกันที่เก็บจากบุคคลภายนอก" },
  "420301001": { depth: 4, name: "เงินประกันซองเสนอราคา" },
  "420301002": { depth: 4, name: "เงินประกันสัญญาซื้อขาย/สัญญาจ้าง" },
  "420301003": { depth: 4, name: "เงินประกันสัญญาการเช่าร้านค้า" },
  "420301004": { depth: 4, name: "เงินประกันผลงาน" },
  "420301007": { depth: 4, name: "เงินประกันร้านอาหาร" },
  "420301999": { depth: 4, name: "อื่น ๆ" },
  "420302000": { depth: 3, name: "เงินประกันที่เก็บจากนักศึกษา" },
  "420302003": { depth: 4, name: "เงินประกันค่าเสียหายห้องปฏิบัติการ" },
  "420302004": { depth: 4, name: "เงินประกันตู้ล็อคเกอร์" },
  "420302012": { depth: 4, name: "เงินประกันของเสียหายทั่วไป" },
  "420302999": { depth: 4, name: "อื่น ๆ" },
  "430000000": { depth: 1, name: "รายรับที่เข้าเป็นทุนหมุนเวียน" },
  "430100000": { depth: 2, name: "เงินรับ-จ่าย ประเภทกองทุน" },
  "430101000": { depth: 3, name: "เงินรับ-จ่าย ประเภทกองทุน" },
  "430101024": { depth: 4, name: "กองทุนพัฒนาและส่งเสริมวิชาการ - คณะวิทย์" },
  "430101025": { depth: 4, name: "กองทุนสัปดาห์วิทย์ฯ - คณะวิทย์" },
  "430101026": { depth: 4, name: "กองทุนพัฒนาบุคลากรฯ-คณะวิทย์" },
  "430101086": {
    depth: 4,
    name: "กองทุนส่งเสริมและพัฒนาการผลิตบัณฑิต-คณะวิทย์"
  },
  "430101099": { depth: 4, name: "กองทุนสนับสนุนการวิจัยฯ-คณะวิทย์" },
  "430101122": { depth: 4, name: "กองทุน 50 ปี คณะวิทย์" },
  "430200000": { depth: 2, name: "เงินบริจากเพื่อทุนการศึกษา (คงยอดเงินต้น)" },
  "430201000": { depth: 3, name: "เงินทุนการศึกษา" },
  "430201999": { depth: 4, name: "ทุนอื่น ๆ" },
  "430202000": { depth: 2, name: "เงินบริจาคเพื่อสนับสนุนสถานศึกษา" },
  "430202001": {
    depth: 4,
    name:
      "เงินบริจาคเพื่อสนับสนุนสถานศึกษา (เงินที่รับบริจาคจากบุคลอื่นเพื่อใช้ซื้อวัสดุ ครุภัณฑ์)"
  },
  "440000000": { depth: 4, name: "รายรับรอการรับรู้" },
  "440101000": { depth: 2, name: "รับจากนักศึกษา" },
  "440101001": { depth: 4, name: "เงินค่าลงทะเบียน" },
  "440101002": { depth: 4, name: "เงินค่าธรรมเนียม" },
  "440102000": { depth: 2, name: "รับจากบุคคลภายนอก" },
  "440102001": { depth: 4, name: "รับเงินช่วยเหลือ/เงินสนับสนุน" },
  "440102002": { depth: 4, name: "รับเงินทุนการศึกษา" },
  "440102003": { depth: 4, name: "รับเงินค่าปรับ" },
  "440102005": { depth: 4, name: "รับบริการวิชาการที่ปรึกษา/วิจัย" },
  "440102007": { depth: 4, name: "รับงินบริจาค" },
  "440102099": { depth: 4, name: "รับอื่น ๆ" }
};
